Documents/ESB/ESB_Consumer_0819/003TestSample/SAMPLE_XML_MUST/CurrentAccount/CA07_CampIntrstRateCanRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/CurrentAccount/CampIntrstRateCanRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>CurrentAccount</ServiceDomain>  
      <OperationName>CampIntrstRateCan</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:CampIntrstRateCanRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>CA07</v11:TxnId>  
        <v11:TxnNo>CA0700001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <v11:ArrngId>80170000000016</v11:ArrngId>  
        <!--Zero or more repetitions:-->  
        <v11:CustRec></v11:CustRec>  
        <v11:ProdName>AC.POCKET.SAV</v11:ProdName>  
        <v11:TxnType>ACCOUNTS-CHANGE-CRINT2.FWDATE</v11:TxnType>  
        <v11:EffDate>20200322</v11:EffDate>  
        <!--Optional:-->  
        <v11:RsnCode>Update future dated CAMPAIGN INT</v11:RsnCode>  
        <v11:PktAcctRateInfo> 
          <!--1 or more repetitions:-->  
          <v11:RateInfo> 
            <v11:FltRate>-</v11:FltRate> 
          </v11:RateInfo> 
        </v11:PktAcctRateInfo>  
        <!--Optional:-->  
        <v11:IPAddr>IP.172.20.15.192</v11:IPAddr>  
        <!--Optional:-->  
        <v11:DevNo>1</v11:DevNo>  
        <!--Optional:-->  
        <v11:EntryDeptCode>N01</v11:EntryDeptCode>  
        <!--Optional:-->  
        <v11:PrftCntr>N01</v11:PrftCntr>  
        <!--Optional:-->  
        <v11:CostCntr>N01</v11:CostCntr>  
        <!--Optional:-->  
        <v11:AuthEmpId>HELEN</v11:AuthEmpId>  
        <!--Optional:-->  
        <v11:EntryEmplNo>HELEN</v11:EntryEmplNo>  
        <!--Optional:-->  
        <v11:VerName>AA.ARRANGEMENT.ACTIVITY,AA.API.NEW.NCB.1.0.0</v11:VerName>  
        <!--Optional:-->  
        <v11:EcoUnit>N01</v11:EcoUnit>  
        <!--Optional:-->  
        <v11:APIKey>NCB-IF01010</v11:APIKey> 
      </v11:ServiceBody> 
    </v11:CampIntrstRateCanRq> 
  </soap:Body> 
</soap:Envelope>
